In [6]:
import numpy as np
import pandas as pd

In [7]:
data = pd.read_csv("data.csv")
data

    Duration Average_Pulse Max_Pulse  Calorie_Burnage  Hours_Work  Hours_Sleep
0       30.0            80       120            240.0        10.0          7.0
1       45.0            85       120            250.0        10.0          7.0
2       45.0            90       130            260.0         8.0          7.0
3       60.0            95       130            270.0         8.0          7.0
4       60.0           100       140            280.0         0.0          7.0
5        NaN           NaN       NaN              NaN         NaN          NaN
6       60.0           105       140            290.0         7.0          8.0
7       60.0           110       145            300.0         7.0          8.0
8       45.0           NaN        AF              NaN         8.0          8.0
9       45.0           115       145            310.0         8.0          8.0
10      60.0           120       150            320.0         0.0          8.0
11      60.0         9 000       130              NaN         NaN          8.0
12      45.0           125       150            330.0         8.0          8.0

In [3]:
data = pd.Series([30.0,45.0,45.0,60.0,60.0,60.0,60.0,45.0,45.0,60.0,60.0,45.0])
data

0     30.0
1     45.0
2     45.0
3     60.0
4     60.0
5     60.0
6     60.0
7     45.0
8     45.0
9     60.0
10    60.0
11    45.0
dtype: float64

In [4]:
data.values

array([30., 45., 45., 60., 60., 60., 60., 45., 45., 60., 60., 45.])

In [5]:
data.index

RangeIndex(start=0, stop=12, step=1)

In [6]:
data

0     30.0
1     45.0
2     45.0
3     60.0
4     60.0
5     60.0
6     60.0
7     45.0
8     45.0
9     60.0
10    60.0
11    45.0
dtype: float64

In [7]:
data = pd.Series([30.0,45.0,45.0,60.0,60.0,60.0,60.0,45.0,45.0,60.0,60.0,45.0], index = ['a','b','c','d','e','f','g','h','i','j','k','l'])
data

a    30.0
b    45.0
c    45.0
d    60.0
e    60.0
f    60.0
g    60.0
h    45.0
i    45.0
j    60.0
k    60.0
l    45.0
dtype: float64

In [8]:
data['k']

60.0

In [21]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [26]:
#dataframe as a generalized NumPy array
area_dict = {'California': 99854,
            'Texas': 24658,
            'New York': 45698,
            'Florida': 78962,
            'Illinois': 98561 }
area = pd.Series(area_dict)
area

California    99854
Texas         24658
New York      45698
Florida       78962
Illinois      98561
dtype: int64

In [27]:
states = pd.DataFrame({'population': population,
                      'area': area})
states

            population   area
California    38332521  99854
Texas         26448193  24658
New York      19651127  45698
Florida       19552860  78962
Illinois      12882135  98561

In [29]:
#from a single series object
pd.DataFrame(population, columns=['population'])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [32]:
#from a list of Dicts
data = [{'a':i, 'b':2 * i, 'c':3 *i}
       for i in range(11)]
pd.DataFrame(data)

     a   b   c
0    0   0   0
1    1   2   3
2    2   4   6
3    3   6   9
4    4   8  12
5    5  10  15
6    6  12  18
7    7  14  21
8    8  16  24
9    9  18  27
10  10  20  30

In [33]:
#from a dictionary of series object
pd.DataFrame({'population': population, 'area': area})

            population   area
California    38332521  99854
Texas         26448193  24658
New York      19651127  45698
Florida       19552860  78962
Illinois      12882135  98561

In [34]:
#from a two dimensional NumPy array
pd.DataFrame(np.random.rand(3, 2), columns=['foo', 'bar'], index=['a', 'b', 'c'])

        foo       bar
a  0.125974  0.733697
b  0.573599  0.843885
c  0.580762  0.871198

In [42]:
#from a NumPy structured array
A =np.zeros(3, dtype=[('A','i8'), ('B','f8')])
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

In [44]:
#index as immutable array
ind = pd.Index([2,3,5,7,11])
ind[::2]

Int64Index([2, 5, 11], dtype='int64')

In [ ]:
#index as ordered set

In [1]:
import numpy as np
import pandas as pd

dataset= [10,12,12,13,12,11,14,13,15,10,10,10,100,12,14,13, 12,10, 10,11,12,15,12,13,12,11,14,13,15,10,15,12,10,14,13,15,10]

In [7]:
import numpy as np
import pandas as pd
outliers=[]
def detect_outlier(data_1):
    
    threshold=3
    mean_1 = np.mean(data_1)
    std_1 =np.std(data_1)
    
    
    for y in data_1:
        z_score= (y - mean_1)/std_1 
        if np.abs(z_score) > threshold:
            outliers.append(y)
    return outliers
outlier_datapoints = detect_outlier(dataset)
print(outlier_datapoints)
sorted(dataset)
q1, q3= np.percentile(dataset,[25,75])
iqr = q3 - q1
lower_bound = q1 -(1.5 * iqr) 
upper_bound = q3 +(1.5 * iqr)

[100]

In [8]:
q1, q3= np.percentile(dataset,[25,75])
iqr = q3 - q1
lower_bound = q1 -(1.5 * iqr)
upper_bound = q3 +(1.5 * iqr)